add architecture, add data
